from Serials import *
from Season import *

def btn():
    print('# -------------------------------- Главное меню -------------------------------- #')
    print("""Команды: 
\'a\' - общий список сериалов
\'b\' - поиск по номеру сезонов
\'c\' - поиск по номеру серии
\'f\' - показать избранное
\'q\' - закрыть программу
""")
def btn2(x):
    b = []
    for i in range(int(len(x))):
        b.append(i+1)
    return b



# ------------------------------------ Список сериалов ------------------------------------ #
serials = [Serials('Game of Thrones', '2011-2019'), Serials('Breaking bad','2008-2013')]

# -------------------------------- Списки серий в сезонах --------------------------------- #
gameOfThrones_season1 = [Serials('Зима близко','2011'),
                            Serials('Королевский тракт','2011'),
                            Serials('Лорд Сноу','2011'),
                            Serials('серия Калеки, бастарды и сломанные вещи','2011'),
                            Serials('Волк и Лев','2011'),
                            Serials('Золотая корона','2011'),
                            Serials('Ты побеждаешь или умираешь','2011'),
                            Serials('Острый конец','2011'),
                            Serials('Бейелор ','2011'),
                            Serials('Пламя и кровь','2011')]
gameOfThrones_season2 = [Serials('Север помнит','2012'),
                            Serials('Ночные Земли','2012'),
                            Serials('То, что мертво, умереть не может','2012'),
                            Serials('Костяной Сад','2012'),
                            Serials('Призрак Харренхола','2012'),
                            Serials('Старые Боги и Новые','2012'),
                            Serials('Человек без чести','2012'),
                            Serials('Принц Винтерфелла','2012'),
                            Serials('Черноводная ','2012'),
                            Serials('Валар Моргулис','2012')]
gameOfThrones_season3 = [Serials('Валар Дохаэрис','2013'),
                            Serials('Чёрные крылья, чёрные вести','2013'),
                            Serials('Стезя страданий','2013'),
                            Serials('Теперь его дозор окончен','2013'),
                            Serials('Поцелованная огнём ','2013'),
                            Serials('Подъём','2013'),
                            Serials('Медведь и прекрасная дева','2013'),
                            Serials('Младшие Сыны','2013'),
                            Serials('Рейны из Кастамере','2013'),
                            Serials('Мать','2013')]
gameOfThrones_season4 = [Serials('Два меча','2014'),
                            Serials('Лев и Роза','2014'),
                            Serials('Разрушительница оков','2014'),
                            Serials('Верный клятве','2014'),
                            Serials('Именуемый первым','2014'),
                            Serials('Законы богов и людей','2014'),
                            Serials('Пересмешник','2014'),
                            Serials('Гора и Змей','2014'),
                            Serials('Дозорные на Стене','2014'),
                            Serials('Дети','2014')]
gameOfThrones_season5 = [Serials('Грядущие войны','2015'),
                            Serials('Чёрно-Белый Дом','2015'),
                            Serials('Его Воробейшество','2015'),
                            Serials('Сыны Гарпии','2015'),
                            Serials('Убей мальчишку','2015'),
                            Serials('Непокорные, несгибаемые, несломленные','2015'),
                            Serials('Дар','2015'),
                            Serials('Суровый Дом','2015'),
                            Serials('Танец драконов','2015'),
                            Serials('Милосердие Матери','2015')]
gameOfThrones_season6 = [Serials('Красная женщина ','2016'),
                            Serials('Дом ','2016'),
                            Serials('Клятвопреступник','2016'),
                            Serials('Книга Неведомого','2016'),
                            Serials('Дверь','2016'),
                            Serials('Кровь моей крови','2016'),
                            Serials('Сломленный человек','2016'),
                            Serials('Никто','2016'),
                            Serials('Битва бастардов','2016'),
                            Serials('Ветра зимы','2016')]
gameOfThrones_season7 = [Serials('Драконий Камень','2017'),
                            Serials('Бурерождённая','2017'),
                            Serials('Правосудие королевы','2017'),
                            Serials('Трофеи войны','2017'),
                            Serials('Восточный дозор','2017'),
                            Serials('За стеной','2017'),
                            Serials('Дракон и волк','2017')]
gameOfThrones_season8 = [Serials('Винтерфелл','2019'),
                            Serials('Рыцарь Семи Королевств','2019'),
                            Serials('Долгая Ночь','2019'),
                            Serials('Последние из Старков','2019'),
                            Serials('Колокола','2019'),
                            Serials('Железный Трон','2019'),]

# ------------------------------------ Список сезонов ------------------------------------- #
gameOfThrones_seasons = [gameOfThrones_season1,
                         gameOfThrones_season2,
                         gameOfThrones_season3,
                         gameOfThrones_season4,
                         gameOfThrones_season5,
                         gameOfThrones_season6,
                         gameOfThrones_season7,
                         gameOfThrones_season8]

# -------------------------------- Списки серий в сезонах --------------------------------- #
breakingBad_season1 = [Serials('Пилотная серия','2008'),
                            Serials('Кто в мешке...','2008'),
                            Serials('...A мешок в реке','2008'),
                            Serials('Раковый больной','2008'),
                            Serials('Cepoe вещество','2008'),
                            Serials('Безумная горсть пустыни','2008'),
                            Serials('Сделка без грубых нарушений','2008')]
breakingBad_season2 = [Serials('Семьсот тридцать семь','2009'),
                            Serials('Поджаренные','2009'),
                            Serials('Укус Мертвой Пчелы','2009'),
                            Serials('На самом дне','2009'),
                            Serials('Бой товара','2009'),
                            Serials('Ку-Ку','2009'),
                            Serials('Синий мет на черном рынке','2009'),
                            Serials('Лучше звонить Солу','2009'),
                            Serials('4 дня на природе','2009'),
                            Serials('Конец всем','2009'),
                            Serials('Мандала','2009'),
                            Serials('Феникс','2009'),
                            Serials('Альбукерке','2009')]
breakingBad_season3 = [Serials('Хватит','2010'),
                            Serials('Безымянный конь','2010'),
                            Serials('Я.П.Т.(Я переспала с Тедом)','2010'),
                            Serials('Зеленый свет','2010'),
                            Serials('Снова в деле','2010'),
                            Serials('Закат','2010'),
                            Serials('Одна минута','2010'),
                            Serials('Вижу тебя','2010'),
                            Serials('В стиле Кафки','2010'),
                            Serials('Муха','2010'),
                            Serials('Эбикью','2010'),
                            Serials('Полумеры','2010'),
                            Serials('Полные меры','2010')]
breakingBad_season4 = [Serials('Канцелярский нож','2011'),
                            Serials('38 калибр','2011'),
                            Serials('День открытых дверей','2011'),
                            Serials('Пулевые отверстия','2011'),
                            Serials('Дробовик','2011'),
                            Serials('Припертые к стенке','2011'),
                            Serials('Хромой пес','2011'),
                            Serials('Братья','2011'),
                            Serials('Жучок','2011'),
                            Serials('На здоровье!','2011'),
                            Serials('Подпол','2011'),
                            Serials('Пора заканчивать','2011'),
                            Serials('Без лица','2011')]
breakingBad_season5 = [Serials('Живи свободным или умри','2012'),
                            Serials('Мадригал','2012'),
                            Serials('Плата за риск','2012'),
                            Serials('Пятьдесят один','2012'),
                            Serials('Недогруз','2012'),
                            Serials('Выкуп','2012'),
                            Serials('Назови мое имя','2012'),
                            Serials('Паря над всем','2012'),
                            Serials('Кровавые деньги','2013'),
                            Serials('Погребенные','2013'),
                            Serials('Признания','2013'),
                            Serials('Бешеный пес','2013'),
                            Serials('Тохаджфйли','2013'),
                            Serials('Оземандия','2013'),
                            Serials('Гранитный штат','2013'),
                            Serials('Фелина','2013')]

# ------------------------------------ Список сезонов ------------------------------------- #
breakingBad_seasons = [breakingBad_season1,
                       breakingBad_season2,
                       breakingBad_season3,
                       breakingBad_season4,
                       breakingBad_season5]

# ----------------------------- Список сериалов с сезонами -------------------------------- #
s = [gameOfThrones_seasons, breakingBad_seasons]

# print(btn2(s[-1][5-1]))
# print(s[2-1][4-1][9-1].show())

